clear; clc;                                 %очищаем рабочее пространство и экран
M = 10;                                     %масса груза, кг
g = 9.8;                                    %ускорение свободного падения, м/с2
l = 1;                                      %длина подвеса груза, м
                                            %модель влияния массы пули на угол отклонения груза
v = 300;                                    %скорость пули, м/с
m = 0.001:0.001:0.03;
a = acos(1-m.^2*v.^2./(2*(m+M).^2*g*l));
a = rad2deg(a);                             %переводим радианы в градусы
subplot(2, 1, 1);
plot(m*1000, a); grid;
xlabel('m, gramm');                         %подписываем оси
ylabel('\alpha, \circ');
title('\alpha = f(m). v = 300 m/c');
                                            %модель скорости пули в зависимости от угла отклонения груза
m = 0.01;                                   %масса пули, кг
a = 0.1:0.1:14;
v = (2*(m+M)^2*g*l*(1-cos(deg2rad(a)))/(m^2)).^0.5;
subplot(2, 1, 2);
plot(a, v); grid;
xlabel('\alpha, \circ');                    %подписываем оси
ylabel('v, m/c');
title('v = f(\alpha). m = 10 gramm.');
